<a href="https://colab.research.google.com/github/datilasilva/sql_gender_equality/blob/main/Gender_Dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Load some libraries we need
import pandas as pd #https://pandas.pydata.org/
import numpy as np #https://numpy.org/
import pandas.io.sql as pd_sql #https://pandas.pydata.org/pandas-docs/version/0.16.0/generated/pandas.io.sql.read_sql.html
import sqlite3 as sql #https://docs.python.org/3/library/sqlite3.html
#%load_ext google.colab.data_table #Colab includes an extension that renders pandas dataframes into interactive displays that can be filtered, sorted, and explored dynamically.

In [ ]:
pd.__version__#Check API version. This is not necessary at all, but I noticed that there were a lot of tutorial with commands that no longer work. Version is important.

'1.1.5'

In [ ]:
from google.colab import drive #https://colab.research.google.com/notebooks/io.ipynb
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

The file contains comma-separated values (CSV) about the artists, tracks, and their popularity scores. The data is extracted using Spotify's developer API. It contains information about tracks from the year 2018 to 2021.

In [ ]:
path = "/content/drive/MyDrive/sql_project_inequalitygender/csv_database/illiterate_world_population.csv"
df = pd.read_csv(path)
# Dataset is now stored in a Pandas Dataframe

In [ ]:
db_conn = sql.connect('GenderInequality.db') #connect/create a database with the name "Inequality_data"
pd_sql.DataFrame.to_sql(df,'illiterate_world_population',db_conn, if_exists='replace') # write to DB as table named "gender"

In [ ]:
print (df.columns)

Index(['year_reference_world', 'illiterate_world_youth_total',
       'illiterate_world_youth_women', 'illiterate_world_youth_men'],
      dtype='object')

In [ ]:
#File (CVS) name: illiterate_world_population.csv
#SubtitleEXCEL(ORIGINAL): Youth Illiterate Population (Number) - National populations aged 15 to 24 years as weights.   
#Command colab FROM: illiterate_world_population
#UNICEF GLOBAL DATABASES
#Illiterate_world_population: The result of illiteracy compared year by year, comparison between genders in percentage.

pd.read_sql(
"""
with new AS (SELECT

  population_women.year_reference_world AS Year,
  population_women.illiterate_world_youth_total AS total_illiterate,
  population_women.illiterate_world_youth_women AS Women,
  population_men.illiterate_world_youth_men AS Men,
  ROUND ((population_women.illiterate_world_youth_women * 100.0)/population_women.illiterate_world_youth_total, 2) AS Percentage_women,
  ROUND ((population_women.illiterate_world_youth_men * 100.0)/population_women.illiterate_world_youth_total, 2) AS Percentage_men
  
FROM illiterate_world_population AS population_women
INNER JOIN illiterate_world_population AS population_men
ON year = population_men.year_reference_world)

SELECT *,
percentage_women - percentage_men AS Difference
FROM new
      
""", db_conn)

    Year  total_illiterate  ...  Percentage_men  Difference
0   1995         162029266  ...           38.91       22.18
1   1996         160501813  ...           39.20       21.60
2   1997         153178589  ...           39.76       20.48
3   1998         146461402  ...           38.38       23.24
4   1999         144747902  ...           38.69       22.62
5   2000         143540625  ...           38.79       22.42
6   2001         145600392  ...           39.22       21.56
7   2002         142516769  ...           38.98       22.04
8   2003         139694071  ...           38.65       22.70
9   2004         133592352  ...           38.96       22.08
10  2005         134223726  ...           38.08       23.84
11  2006         132737729  ...           38.49       23.02
12  2007         133437062  ...           39.90       20.20
13  2008         126640609  ...           39.25       21.50
14  2009         125602211  ...           39.66       20.68
15  2010         125129301  ...           40.50       19.00
16  2011         125802271  ...           42.44       15.12
17  2012         113170173  ...           40.99       18.02
18  2013         110875305  ...           41.49       17.02
19  2014         106885389  ...           42.05       15.90
20  2015         104368506  ...           42.61       14.78

[21 rows x 7 columns]

In [ ]:
path = "/content/drive/MyDrive/sql_project_inequalitygender/csv_database/illiterate_by_year.csv"
df = pd.read_csv(path)
# Dataset is now stored in a Pandas Dataframe

In [ ]:
db_conn = sql.connect('GenderInequality.db') #connect/create a database with the name "Inequality_data"
pd_sql.DataFrame.to_sql(df,'illiterate_by_year',db_conn, if_exists='replace') # write to DB as table named "gender"

In [ ]:
print (df.columns)

Index(['illiterate_year', 'illiterate_men', 'illiterate_women',
       'illiterate_black_women', 'illiterate_white_women',
       'illiterate_black_men', 'illiterate_white_men'],
      dtype='object')

In [ ]:
path = "/content/drive/MyDrive/sql_project_inequalitygender/csv_database/year_aplication_brazil.csv"
df = pd.read_csv(path)
# Dataset is now stored in a Pandas Dataframe

In [ ]:
db_conn = sql.connect('GenderInequality.db') #connect/create a database with the name "Inequality_data"
pd_sql.DataFrame.to_sql(df,'year_aplication_brazil',db_conn, if_exists='replace') # write to DB as table named "gender"

In [ ]:
print (df.columns)

Index(['year_reference_application', 'graduation_application_brazil',
       'brazil_population'],
      dtype='object')

In [ ]:
#Year_aplication_brazil: ​​join the table year_aplication_brazil with Illiterate_by_year. Add the total of the first and compare in millions the level of illiteracy with the 
#number of enrollments in higher education in 2015 and AVG illiterate_br and AVG Enrollment. Percentage
#File (CVS) name: illiterate_by_year.csv. Table number EXCEL(ORIGINAL): Tabela 3.4b1. Command colab FROM: illiterate_by_year
#SubtitleEXCEL(ORIGINAL): illiterate 15 years old or more - 1995/2015
#File (CVS) name: year_aplication_brazil.csv
#SubtitleEXCEL(ORIGINAL): INEP - Erollement (Graduation) 2019 - Command colab FROM:  year_aplication_brazil

pd.read_sql(
"""
with new AS (SELECT
AVG(brazil_population) as avg_population,
ROUND(AVG(graduation_application_brazil),1) as avg_enrollment,
ROUND(AVG(illiterate_by_year.illiterate_men + illiterate_by_year.illiterate_women),1) as avg_illiterate
FROM year_aplication_brazil
JOIN illiterate_by_year
ON year_reference_application = illiterate_year)

SELECT 
avg_population,
avg_enrollment,
avg_illiterate,
(avg_population * 100.0)/avg_population AS Percentage_population,
(avg_enrollment * 100.0)/avg_population AS Percentage_enrollment,
(avg_illiterate * 100.0)/avg_population AS Percentage_illiterate

FROM new
""", db_conn)

   avg_population  avg_enrollment  ...  Percentage_enrollment  Percentage_illiterate
0     196524506.0       6927330.7  ...                3.52492                 6.8047

[1 rows x 6 columns]

In [ ]:
path = "/content/drive/MyDrive/sql_project_inequalitygender/csv_database/illiterate_race.csv"
df = pd.read_csv(path)
# Dataset is now stored in a Pandas Dataframe

In [ ]:
db_conn = sql.connect('GenderInequality.db') #connect/create a database with the name "Inequality_data"
pd_sql.DataFrame.to_sql(df,'illiterate_race',db_conn, if_exists='replace') # write to DB as table named "gender"

In [ ]:
print (df.columns)

Index(['illiterate_year', 'illiterate_black_women', 'illiterate_white_women',
       'illiterate_black_men', 'illiterate_white_men'],
      dtype='object')

In [ ]:
# Illiterate_race: 1) difference in the illiteracy rate between genders and race a)black women x white women, b)black men x white men, c)White women x White men, d)Black women x black men
#File (CVS) name: illiterate_race.csv
#Table number EXCEL(ORIGINAL): Tabela 3.4a1
#SubtitleEXCEL(ORIGINAL): População analfabeta de 15 anos ou mais de idade, por sexo, segundo cor/raça - Brasil e Regiões, 1995 a 2015	Command colab FROM: illiterate_race	
pd.read_sql(
  """
    SELECT 
    illiterate_year AS year, 
    illiterate_black_women AS black_women, 
    illiterate_white_women AS white_women,
    illiterate_black_men AS black_men,
    illiterate_white_men AS white_men,
    illiterate_white_women - illiterate_white_men AS difference_white,
    illiterate_black_men - illiterate_black_women AS difference_black
    FROM illiterate_race

  """, db_conn)

    year  black_women  ...  difference_white  difference_black
0   1995      5176404  ...            712992             23112
1   1996      4862312  ...            748613             -8313
2   1997      5175279  ...            691299             41585
3   1998      4959518  ...            618400             77586
4   1999      5020964  ...            510528            -36682
5   2001      5002179  ...            527945             -1447
6   2002      4798797  ...            522065            149711
7   2003      4949945  ...            554620             93098
8   2004      5003434  ...            513239            154536
9   2005      4986868  ...            518104            231573
10  2006      4830032  ...            428023            184027
11  2007      4802512  ...            405342            182309
12  2008      4819421  ...            424939            133871
13  2009      4909551  ...            471531             28820
14  2011      4450767  ...            318722            117932
15  2012      4598380  ...            327163            226902
16  2013      4578192  ...            379755            269177
17  2014      4554707  ...            277523            253546
18  2015      4467278  ...            278471            226973

[19 rows x 7 columns]

In [ ]:
path = "/content/drive/MyDrive/sql_project_inequalitygender/csv_database/avg_study_year.csv"
df = pd.read_csv(path)
# Dataset is now stored in a Pandas Dataframe

In [ ]:
db_conn = sql.connect('GenderInequality.db') #connect/create a database with the name "Inequality_data"
pd_sql.DataFrame.to_sql(df,'avg_study_year',db_conn, if_exists='replace') # write to DB as table named "gender"

In [ ]:
print (df.columns)

Index(['year_reference', 'avg_year_blackwomen_study',
       'avg_year_whitewomen_study', 'avg_year_blackmen_study',
       'avg_year_whitemen_study'],
      dtype='object')

In [ ]:
#  Avg_study_year: 1) difference in evolution of the amount of studied years between genders and race. a)black women x white women, b)black men x white men,  c)White women x White men, 
#d)Black women x black men
#File (CVS) name: avg_study_year.csv
#Table number EXCEL(ORIGINAL): Tabela 3.1b
#SubtitleEXCEL(ORIGINAL): AVG years population - Brazil, 1995/2015	-	Command colab FROM: avg_study_year	

pd.read_sql ("""
    SELECT year_reference as year,
    avg_year_whitewomen_study AS whitewomen,
    avg_year_blackwomen_study AS blackwomen,
    avg_year_whitewomen_study - avg_year_blackwomen_study AS difference
    FROM avg_study_year;
  """, db_conn)

    year  whitewomen  blackwomen  difference
0   1995         6.1         4.2         1.9
1   1996         5.9         4.1         1.8
2   1997         6.1         4.2         1.9
3   1998         6.2         4.4         1.8
4   1999         6.4         4.5         1.9
5   2001         6.7         4.9         1.8
6   2002         6.8         5.1         1.7
7   2003         7.0         5.3         1.7
8   2004         7.1         5.4         1.7
9   2005         7.2         5.6         1.6
10  2006         7.4         5.8         1.6
11  2007         7.5         5.9         1.6
12  2008         7.7         6.1         1.6
13  2009         7.8         6.2         1.6
14  2011         7.9         6.5         1.4
15  2012         8.2         6.7         1.5
16  2013         8.3         6.8         1.5
17  2014         8.4         7.0         1.4
18  2015         8.5         7.1         1.4

In [ ]:
path = "/content/drive/MyDrive/sql_project_inequalitygender/csv_database/avg_poverty_year.csv"
df = pd.read_csv(path)
# Dataset is now stored in a Pandas Dataframe

In [ ]:
db_conn = sql.connect('GenderInequality.db') #connect/create a database with the name "Inequality_data"
pd_sql.DataFrame.to_sql(df,'avg_poverty_year',db_conn, if_exists='replace') # write to DB as table named "gender"

In [ ]:
print (df.columns)

Index(['year_reference_poverty', 'avg_year_ext_poor_blackwomen',
       'avg_year_ext_poor_whitewomen', 'avg_year_ext_poor_blackmen',
       'avg_year_ext_poor_whitemen', 'avg_year_poor_blackwomen',
       'avg_year_poor_whitewomen', 'avg_year_poor_blackmen',
       'avg_year_poor_whitemen', 'avg_year_vulnerable_blackwomen',
       'avg_year_vulnerable_whitewomen', 'avg_year_vulnerable_blackmen',
       'avg_year_vulnerable_whitemen', 'avg_year_not_poor_blackwomen',
       'avg_year_not_poor_whitewomen', 'avg_year_not_poor_blackmen',
       'avg_year_not_poor_whitemen'],
      dtype='object')

In [ ]:
#Avg_poverty_year: the difference between years of schooling between poverty levels according to the respective genders. 
#File (CVS) name: avg_poverty_year.csv
#Table number EXCEL(ORIGINAL): Tabela 3.1d	SubtitleEXCEL(ORIGINAL): AVG study years (15 years or more-  1995 / 2015 Brazil)
#Command colab FROM: avg_poverty_year
pd.read_sql(
"""
SELECT ROUND(AVG(avg_year_ext_poor_blackwomen),2) AS ext_poor_blackwomen,
ROUND(AVG(avg_year_ext_poor_whitewomen),2) AS ext_poor_whitewomen,
ROUND(AVG(avg_year_ext_poor_blackmen),2) AS ext_poor_blackmen,
ROUND(AVG(avg_year_ext_poor_whitemen),2) AS ext_poor_whitemen,
ROUND(AVG(avg_year_poor_blackwomen),2) AS poor_blackwomen,
ROUND(AVG(avg_year_poor_whitewomen),2) AS poor_whitewomen,
ROUND(AVG(avg_year_poor_blackmen),2) AS poor_blackmen,
ROUND(AVG(avg_year_poor_whitemen),2) AS poor_whitemen,
ROUND(AVG(avg_year_vulnerable_blackwomen),2) AS vulnerable_blackwomen,
ROUND(AVG(avg_year_vulnerable_whitewomen),2) AS vulnerable_whitewomen,
ROUND(AVG(avg_year_vulnerable_blackmen),2) AS vulnerable_blackmen,
ROUND(AVG(avg_year_vulnerable_whitemen),2) AS vulnerable_whitemen,
ROUND(AVG(avg_year_not_poor_blackwomen),2) AS not_poor_blackwomen,
ROUND(AVG(avg_year_not_poor_whitewomen),2) AS not_poor_whitewomen,
ROUND(AVG(avg_year_not_poor_blackmen),2) AS not_poor_blackmen,
ROUND(AVG(avg_year_not_poor_whitemen),2) AS not_poor_whitemen
FROM avg_poverty_year
      
""", db_conn)

   ext_poor_blackwomen  ...  not_poor_whitemen
0                 4.35  ...               9.66

[1 rows x 16 columns]

In [ ]:
path = "/content/drive/MyDrive/sql_project_inequalitygender/csv_database/avg_study_job_year.csv"
df = pd.read_csv(path)
# Dataset is now stored in a Pandas Dataframe

In [ ]:
db_conn = sql.connect('GenderInequality.db') #connect/create a database with the name "Inequality_data"
pd_sql.DataFrame.to_sql(df,'avg_study_job_year',db_conn, if_exists='replace') # write to DB as table named "gender"

In [ ]:
print (df.columns)

Index(['year_job', 'avg_year_blackwomen_study_job',
       'avg_year_whitewomen_study_job', 'avg_year_blackmen_study_job',
       'avg_year_whitemen_study_job'],
      dtype='object')

In [ ]:
#avg_study_job_year: Discover which gender and race  has the most need to work and study simultaneously. Ex: What is the percentage of black people that have to work and study simultaneously.? 
#File (CVS) name: avg_study_job_year.csv
#Table number EXCEL(ORIGINAL): Tabela 3.1c2			SubtitleEXCEL(ORIGINAL): Média de anos de estudo das pessoas ocupadas com 16 anos ou mais de idade, segundo cor/raça, sexo - Brasil, 1995 a 2015		
#Command colab FROM: avg_study_job_year.csv
pd.read_sql(
"""
SELECT 
ROUND(AVG(avg_year_blackwomen_study_job),2) AS blackwomen_study_job,
ROUND(AVG(avg_year_whitewomen_study_job),2) AS whitewomen_study_job,
ROUND(AVG(avg_year_blackmen_study_job),2) AS blackmen_study_job,
ROUND(AVG(avg_year_whitemen_study_job),2) AS whitemen_study_job
FROM avg_study_job_year
      
""", db_conn)

   blackwomen_study_job  ...  whitemen_study_job
0                  6.93  ...                8.09

[1 rows x 4 columns]